# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [3]:
baby_names = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')

### Step 4. See the first 10 entries

In [4]:
baby_names.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [6]:
baby_names = baby_names.drop(['Unnamed: 0', 'Id'], axis = 1)

### Step 6. Is there more male or female names in the dataset?

In [25]:
baby_names.Gender.value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [35]:
names = baby_names.groupby('Name', as_index=False)['Count'].sum()

### Step 8. How many different names exist in the dataset?

In [36]:
len(names)

17632

### Step 9. What is the name with most occurrences?

In [39]:
names.sort_values('Count', ascending = False)

             Name   Count
7198        Jacob  242874
5378         Emma  214852
12111     Michael  214405
5579        Ethan  209277
6973     Isabella  204798
...           ...     ...
5453       Eniola       5
2037     Atlantis       5
11478       Marci       5
15236  Simarpreet       5
13010        Nita       5

[17632 rows x 2 columns]

### Step 10. How many different names have the least occurrences?

In [41]:
len(names.loc[names.Count == names.Count.min()])

2578

### Step 11. What is the median name occurrence?

In [42]:
names.loc[names.Count == names.Count.median()]

          Name  Count
524    Aishani     49
637      Alara     49
986     Alysse     49
1083     Ameir     49
1360     Anely     49
...        ...    ...
15403   Sriram     49
16250  Trinton     49
16622     Vita     49
17119     Yoni     49
17570  Zuleima     49

[66 rows x 2 columns]

### Step 12. What is the standard deviation of names?

In [43]:
names.Count.std()

11006.069467891111

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [44]:
names.describe()

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000